[
  {
   "common_name": "Lemongrass",
   "picture": "lemongrass.jpg",
   "scientific_name": "Cymbopogon citratus",
   "family": "Poaceae",
   "zone": ["10", "11"],
   "perennial": true,
   "layers": ["Herbaceous"],
   "plant_function": ["Culinary", "Medicinal", "Aromatic"],
   "description": "Lemongrass is a tropical perennial herb native to South Asia and Southeast Asia. It features tall, slender, green leaves that emit a strong lemon fragrance when crushed. Commonly used in Asian cuisine, it imparts a citrusy flavor to dishes and is also utilized in teas and as an essential oil. Beyond its culinary applications, lemongrass has been employed in traditional medicine for its potential health benefits, including anti-inflammatory and antimicrobial properties.",
   "purpose": "In permaculture, lemongrass serves multiple functions:\n\n1. **Culinary Use**: Provides a fresh, lemony flavor to various dishes, enhancing the diversity of flavors in a permaculture system.\n\n2. **Medicinal Properties**: Traditionally used to alleviate digestive issues, reduce fever, and as an antimicrobial agent, contributing to the health and well-being of the community.\n\n3. **Aromatic Qualities**: Acts as a natural insect repellent, deterring pests and enhancing the sensory experience of the garden environment.\n\n4. **Soil Improvement**: Its deep root system can help break up compacted soil, improving soil structure and water infiltration.\n\n5. **Erosion Control**: The dense growth habit of lemongrass can help stabilize soil and prevent erosion, especially on slopes or in areas prone to water runoff.",
   "conditions": "Lemongrass thrives in warm, tropical climates with the following conditions:\n\n- **Sunlight**: Requires full sun, at least 6–8 hours of direct sunlight per day, to grow optimally.\n\n- **Soil**: Prefers well-drained, loamy soil with a pH between 5.5 and 7.5. Heavy or clay soils are not suitable.\n\n- **Watering**: Needs consistent moisture, especially during dry periods, but does not tolerate waterlogged conditions.\n\n- **Temperature**: Grows best in temperatures between 25°C and 35°C (77°F and 95°F). It is frost-sensitive and should be protected from freezing temperatures.\n\n- **Humidity**: Prefers high humidity but can tolerate moderate levels.",
   "companions": "Lemongrass benefits from being planted alongside other sun-loving, drought-tolerant plants. Suitable companions include:\n\n- **Basil**: Shares similar sunlight and watering needs, and their combined aroma can enhance pest deterrence.\n\n- **Chili Peppers**: Both thrive in warm conditions and can benefit from the shade provided by lemongrass during the hottest part of the day.\n\n- **Tomatoes**: Can be planted near lemongrass to take advantage of the pest-repelling properties of lemongrass.\n\n- **Marigolds**: Their strong scent complements that of lemongrass, providing additional pest control.\n\n- **Garlic**: Acts as a natural pest repellent and shares similar growing conditions.",
   "avoid": "Avoid planting lemongrass near plants that prefer cooler temperatures or those susceptible to pests that lemongrass attracts. Plants to avoid include:\n\n- **Lettuce**: Prefers cooler temperatures and may not thrive under the shade of lemongrass.\n\n- **Spinach**: Also prefers cooler conditions and may bolt (flower prematurely) in the heat generated by lemongrass.\n\n- **Cabbage**: Susceptible to pests like aphids, which can be attracted to lemongrass.\n\n- **Carrots**: May not compete well with lemongrass for nutrients and space, especially if the lemongrass is allowed to grow unchecked.\n\n- **Potatoes**: Prefer cooler soil temperatures and may not perform well in the warmer conditions favored by lemongrass.",
   "pests": "While lemongrass is generally resistant to pests, it can occasionally attract certain insects:\n\n- **Aphids**: Small, sap-sucking insects that can cause damage to young plants.\n\n- **Caterpillars**: The larvae of various moths and butterflies may feed on lemongrass leaves.\n\n- **Mealybugs**: Small, white, cotton-like insects that can infest the plant.\n\n- **Scale Insects**: Small, immobile insects that attach to the plant and suck sap.\n\nTo manage these pests, regularly inspect the plants, remove affected leaves, and consider introducing natural predators or using organic insecticidal soaps."
  }
]