[
    {
       "common_name": "Tithonia",
       "picture": "tithonia.jpg",
       "scientific_name": "Tithonia diversifolia",
       "family": "Asteraceae",
       "zone": "9-11",
       "perennial": true,
       "layers": ["Herbaceous", "Shrub", "Groundcover"],
       "plant_function": ["Wildlife Attractor", "Edible", "Medicinal", "Windbreaker, Nitrogen Fixer"],
       "description": "Tithonia is a fast-growing perennial shrub native to Central America. Known for its vibrant orange flowers, it is a popular choice for attracting pollinators like bees and butterflies. Tithonia has edible leaves, used in some regions for medicinal purposes, and is also a valuable plant for soil improvement due to its deep rooting system.",
       "purpose": "Tithonia plays several important roles in permaculture systems:\n\n1. **Nitrogen Fixation**: Tithonia is often used as a nitrogen fixer, enhancing soil fertility by fixing nitrogen in the soil. It works well as a green manure, and its deep roots can bring up nutrients from lower soil layers, enriching the upper soil.\n\n2. **Soil Enrichment**: Tithonia adds organic matter to the soil when its leaves decompose. This helps improve soil structure, increase moisture retention, and encourage the growth of beneficial microbes. The plant’s deep root system also helps break up compacted soils, improving water infiltration.\n\n3. **Pollinator Attractor**: The vibrant orange flowers of Tithonia attract bees, butterflies, and other pollinators, making it an excellent addition to any permaculture garden. Its blooms are especially important in supporting the health of pollinator populations.\n\n4. **Compost and Mulch**: Tithonia’s fast-growing nature makes it an excellent source of green material for composting. The plant can be chopped and added to compost piles to help create nutrient-rich compost. It can also be used as mulch around other plants to help retain moisture and suppress weeds.\n\n5. **Animal Fodder**: Tithonia is also used as livestock fodder in some permaculture systems. Its leaves are rich in nutrients and can be fed to animals, particularly goats and cattle. However, it should be used in moderation as it can be toxic in large quantities.\n\nIn summary, Tithonia serves as a multi-functional plant in permaculture systems. Its ability to fix nitrogen, improve soil health, attract pollinators, and provide organic matter for compost or animal fodder makes it an invaluable resource for creating sustainable, regenerative ecosystems.",
       "conditions": "Tithonia is known for its robust growing conditions and versatility in the garden. It thrives in full sun and can tolerate a variety of soil types, though it prefers well-drained, slightly acidic to neutral soil. The plant is drought-tolerant once established, making it ideal for dry climates, but it also performs well with moderate watering. Tithonia can reach up to 6 feet in height and produces bright orange or yellow daisy-like flowers that attract pollinators, especially bees and butterflies. It can be grown as a windbreak or as a soil-improving plant due to its deep roots that help break up compacted soil and add organic matter. Tithonia is often used in permaculture systems for its role in improving soil fertility, supporting biodiversity, and providing aesthetic value with its vibrant flowers. Its deep taproot and dense growth also make it effective for preventing soil erosion in areas prone to degradation. Tithonia is ideal for planting in garden beds, agroforestry systems, or as a hedge or border plant in permaculture designs.",
       "companions": "Beans, Corn, Squash, Sunflowers, Marigolds",
       "avoid": "Plants prone to pests. Tithonia can attract a lot of pollinators, but it can also attract certain pests like aphids and caterpillars. Avoid planting it near plants that are susceptible to these pests or diseases, as they could spread quickly.\n\n Tithonia can attract a lot of pollinators, but it can also attract certain pests like aphids and caterpillars. Avoid planting it near plants that are susceptible to these pests or diseases, as they could spread quickly.\n\n Plants with shallow roots and slow growing plants. Tithonia has a deep taproot and can grow quite tall (up to 6 feet or 1.8 meters), and its bushy growth can overshadow smaller plants, especially those that need full sunlight.   ",
       "pests": "Whiteflies, Spider Mites"
    }
]